# Exercícios - Banco de Dados SQL

Exercícios realizados no Bootcamp de Data Analytics da WoMakersCode.

**Aluna: Isabella Stersa de Oliveira**

In [1]:
# Importar biblioteca
import sqlite3

In [4]:
# Criar o banco de dados SQLite
conexao = sqlite3.connect('banco_exercicio.db')
# Criar um cursor
cursor = conexao.cursor()

1. Crie uma tabela chamada "alunos" com os seguintes campos: id (inteiro), nome (texto), idade (inteiro) e curso (texto).

In [5]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS alunos (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nome VARCHAR(200),
    idade INT,
    curso VARCHAR(100)
)
''')

2. Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.

In [6]:
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Ana Silva', 20, 'Matemática')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('João Pereira', 22, 'Engenharia de Computação')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Maria Oliveira', 21, 'Biologia')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Carlos Santos', 23, 'Química')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Fernanda Costa', 19, 'Física')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Lucas Almeida', 24, 'Economia')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Juliana Ferreira', 22, 'Administração')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Roberto Lima', 20, 'Psicologia')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Mariana Rocha', 21, 'Arquitetura')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Paulo Souza', 23, 'Medicina')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Tatiane Lima', 22, 'Direito')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Felipe Martins', 21, 'Engenharia Civil')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Beatriz Castro', 20, 'Educação Física')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Gustavo Oliveira', 24, 'Matemática')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Jéssica Campos', 19, 'Ciências Sociais')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Rafael Silva', 22, 'História')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Camila Costa', 21, 'Design Gráfico')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Pedro Henrique', 23, 'Engenharia Elétrica')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Larissa Gomes', 20, 'Administração')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Bruno Santos', 22, 'Engenharia de Produção')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Gabriela Martins', 21, 'Veterinária')")

conexao.commit()

3. Consultas Básicas
Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecionar todos os registros da tabela "alunos".

In [7]:
dados = cursor.execute('SELECT * FROM alunos')

for usuario in dados:
    print(usuario)

(1, 'Ana Silva', 20, 'Matemática')
(2, 'João Pereira', 22, 'Engenharia de Computação')
(3, 'Maria Oliveira', 21, 'Biologia')
(4, 'Carlos Santos', 23, 'Química')
(5, 'Fernanda Costa', 19, 'Física')
(6, 'Lucas Almeida', 24, 'Economia')
(7, 'Juliana Ferreira', 22, 'Administração')
(8, 'Roberto Lima', 20, 'Psicologia')
(9, 'Mariana Rocha', 21, 'Arquitetura')
(10, 'Paulo Souza', 23, 'Medicina')
(11, 'Tatiane Lima', 22, 'Direito')
(12, 'Felipe Martins', 21, 'Engenharia Civil')
(13, 'Beatriz Castro', 20, 'Educação Física')
(14, 'Gustavo Oliveira', 24, 'Matemática')
(15, 'Jéssica Campos', 19, 'Ciências Sociais')
(16, 'Rafael Silva', 22, 'História')
(17, 'Camila Costa', 21, 'Design Gráfico')
(18, 'Pedro Henrique', 23, 'Engenharia Elétrica')
(19, 'Larissa Gomes', 20, 'Administração')
(20, 'Bruno Santos', 22, 'Engenharia de Produção')
(21, 'Gabriela Martins', 21, 'Veterinária')

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [8]:
dados = cursor.execute('SELECT * FROM alunos WHERE idade > 20')

for usuario in dados:
    print(usuario)

(2, 'João Pereira', 22, 'Engenharia de Computação')
(3, 'Maria Oliveira', 21, 'Biologia')
(4, 'Carlos Santos', 23, 'Química')
(6, 'Lucas Almeida', 24, 'Economia')
(7, 'Juliana Ferreira', 22, 'Administração')
(9, 'Mariana Rocha', 21, 'Arquitetura')
(10, 'Paulo Souza', 23, 'Medicina')
(11, 'Tatiane Lima', 22, 'Direito')
(12, 'Felipe Martins', 21, 'Engenharia Civil')
(14, 'Gustavo Oliveira', 24, 'Matemática')
(16, 'Rafael Silva', 22, 'História')
(17, 'Camila Costa', 21, 'Design Gráfico')
(18, 'Pedro Henrique', 23, 'Engenharia Elétrica')
(20, 'Bruno Santos', 22, 'Engenharia de Produção')
(21, 'Gabriela Martins', 21, 'Veterinária')

c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética.

In [11]:
dados = cursor.execute("SELECT * FROM alunos WHERE curso LIKE 'Engenharia%'")

for usuario in dados:
    print(usuario)

(2, 'João Pereira', 22, 'Engenharia de Computação')
(12, 'Felipe Martins', 21, 'Engenharia Civil')
(18, 'Pedro Henrique', 23, 'Engenharia Elétrica')
(20, 'Bruno Santos', 22, 'Engenharia de Produção')

d) Contar o número total de alunos na tabela

In [23]:
dados = cursor.execute("SELECT COUNT(*) FROM alunos")

for usuario in dados:
    print(f'Total de alunos na tabela: {usuario[0]}')

Total de alunos na tabela: 20

4. Atualização e Remoção

a) Atualize a idade de um aluno específico na tabela.

In [13]:
cursor.execute("UPDATE alunos SET idade = 28 WHERE id = 4")
conexao.commit()

dados = cursor.execute("SELECT * FROM alunos WHERE id =4")

for usuario in dados:
    print(usuario)

(4, 'Carlos Santos', 28, 'Química')

b) Remova um aluno pelo seu ID.

In [15]:
cursor.execute("DELETE FROM alunos WHERE id = 21")
conexao.commit()

dados = cursor.execute("SELECT * FROM alunos")

for usuario in dados:
    print(usuario)

(1, 'Ana Silva', 20, 'Matemática')
(2, 'João Pereira', 22, 'Engenharia de Computação')
(3, 'Maria Oliveira', 21, 'Biologia')
(4, 'Carlos Santos', 28, 'Química')
(5, 'Fernanda Costa', 19, 'Física')
(6, 'Lucas Almeida', 24, 'Economia')
(7, 'Juliana Ferreira', 22, 'Administração')
(8, 'Roberto Lima', 20, 'Psicologia')
(9, 'Mariana Rocha', 21, 'Arquitetura')
(10, 'Paulo Souza', 23, 'Medicina')
(11, 'Tatiane Lima', 22, 'Direito')
(12, 'Felipe Martins', 21, 'Engenharia Civil')
(13, 'Beatriz Castro', 20, 'Educação Física')
(14, 'Gustavo Oliveira', 24, 'Matemática')
(15, 'Jéssica Campos', 19, 'Ciências Sociais')
(16, 'Rafael Silva', 22, 'História')
(17, 'Camila Costa', 21, 'Design Gráfico')
(18, 'Pedro Henrique', 23, 'Engenharia Elétrica')
(19, 'Larissa Gomes', 20, 'Administração')
(20, 'Bruno Santos', 22, 'Engenharia de Produção')

5. Crie uma tabela chamada "clientes" com os campos: id (chave primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns registros de clientes na tabela.

In [16]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS clientes (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nome VARCHAR(200),
    idade INT,
    saldo FLOAT
)
''')

In [17]:
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Ana Silva', 28, 1000.50)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('João Pereira', 35, 1500.75)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Maria Oliveira', 42, 2000.00)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Carlos Santos', 30, 2500.25)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Fernanda Costa', 29, 3000.00)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Lucas Almeida', 31, 3500.50)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Juliana Ferreira', 27, 4000.00)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Roberto Lima', 38, 4500.75)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Mariana Rocha', 33, 5000.00)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Paulo Souza', 40, 5500.50)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Tatiane Lima', 26, 6000.00)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Felipe Martins', 37, 6500.75)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Beatriz Castro', 34, 7000.00)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Gustavo Oliveira', 41, 7500.50)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Jéssica Campos', 32, 8000.00)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Rafael Silva', 39, 8500.75)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Camila Costa', 29, 9000.00)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Pedro Henrique', 36, 9500.50)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Larissa Gomes', 31, 10000.00)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Bruno Santos', 28, 10500.75)")

conexao.commit()

6. Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.

In [18]:
dados = cursor.execute("SELECT nome, idade FROM clientes WHERE idade > 30")

for usuario in dados:
    print(usuario)

('João Pereira', 35)
('Maria Oliveira', 42)
('Lucas Almeida', 31)
('Roberto Lima', 38)
('Mariana Rocha', 33)
('Paulo Souza', 40)
('Felipe Martins', 37)
('Beatriz Castro', 34)
('Gustavo Oliveira', 41)
('Jéssica Campos', 32)
('Rafael Silva', 39)
('Pedro Henrique', 36)
('Larissa Gomes', 31)

b) Calcule o saldo médio dos clientes.

In [24]:
dados = cursor.execute("SELECT AVG(saldo) FROM clientes")

for usuario in dados:
    print(f'Saldo médio dos clientes: R$ {usuario[0]:.2f}')

Saldo médio dos clientes: R$ 5750.32

c) Encontre o cliente com o saldo máximo.

In [25]:
dados = cursor.execute("SELECT * FROM clientes WHERE saldo IN (SELECT MAX(saldo) FROM clientes)")

for usuario in dados:
    print(usuario)

(20, 'Bruno Santos', 28, 10500.75)

d) Conte quantos clientes têm saldo acima de 1000.

In [26]:
dados = cursor.execute("SELECT COUNT(*) FROM clientes WHERE saldo > 1000")

for usuario in dados:
    print(f'Quantidade de clientes com saldo acima de R$ 1000,00: {usuario[0]}')

Quantidade de clientes com saldo acima de R$ 1000,00: 20

7. Atualização e Remoção com Condições

a) Atualize o saldo de um cliente específico.

In [27]:
cursor.execute("UPDATE clientes SET saldo = 530.10 WHERE id = 4")
conexao.commit()

dados = cursor.execute("SELECT * FROM clientes WHERE id =4")

for usuario in dados:
    print(usuario)

(4, 'Carlos Santos', 30, 530.1)

b) Remova um cliente pelo seu ID.

In [28]:
cursor.execute("DELETE FROM clientes WHERE id = 20")
conexao.commit()

dados = cursor.execute("SELECT * FROM clientes")

for usuario in dados:
    print(usuario)

(1, 'Ana Silva', 28, 1000.5)
(2, 'João Pereira', 35, 1500.75)
(3, 'Maria Oliveira', 42, 2000.0)
(4, 'Carlos Santos', 30, 530.1)
(5, 'Fernanda Costa', 29, 3000.0)
(6, 'Lucas Almeida', 31, 3500.5)
(7, 'Juliana Ferreira', 27, 4000.0)
(8, 'Roberto Lima', 38, 4500.75)
(9, 'Mariana Rocha', 33, 5000.0)
(10, 'Paulo Souza', 40, 5500.5)
(11, 'Tatiane Lima', 26, 6000.0)
(12, 'Felipe Martins', 37, 6500.75)
(13, 'Beatriz Castro', 34, 7000.0)
(14, 'Gustavo Oliveira', 41, 7500.5)
(15, 'Jéssica Campos', 32, 8000.0)
(16, 'Rafael Silva', 39, 8500.75)
(17, 'Camila Costa', 29, 9000.0)
(18, 'Pedro Henrique', 36, 9500.5)
(19, 'Larissa Gomes', 31, 10000.0)

8. Junção de Tabelas

Crie uma segunda tabela chamada "compras" com os campos: id (chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

In [29]:
# Criar a tabela compras
cursor.execute('''
CREATE TABLE IF NOT EXISTS compras (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    cliente_id INTEGER,
    produto TEXT,
    valor REAL,
    FOREIGN KEY (cliente_id) REFERENCES clientes (id)
)
''')

In [30]:
# Inserir registros na tabela compras
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (1, 'Laptop', 1500.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (2, 'Mouse', 50.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (3, 'Smartphone', 800.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (4, 'Capacete', 70.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (5, 'Mesa', 200.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (5, 'Cadeira', 120.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (8, 'Monitor', 300.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (13, 'Teclado', 100.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (13, 'Fone de Ouvido', 80.00)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (19, 'Impressora', 250.00)")

conexao.commit()

In [32]:
# Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

dados = cursor.execute("SELECT clientes.nome, compras.produto, compras.valor FROM clientes INNER JOIN compras ON clientes.id = compras.cliente_id")

for usuario in dados:
    print(usuario)

('Ana Silva', 'Laptop', 1500.0)
('João Pereira', 'Mouse', 50.0)
('Maria Oliveira', 'Smartphone', 800.0)
('Carlos Santos', 'Capacete', 70.0)
('Fernanda Costa', 'Mesa', 200.0)
('Fernanda Costa', 'Cadeira', 120.0)
('Roberto Lima', 'Monitor', 300.0)
('Beatriz Castro', 'Teclado', 100.0)
('Beatriz Castro', 'Fone de Ouvido', 80.0)
('Larissa Gomes', 'Impressora', 250.0)

In [ ]:
# Fechando conexão 
conexao.close()